tap "daviderestivo/emacs-head"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask.git"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions"
tap "homebrew/core", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-core.git"
tap "homebrew/services"
tap "mongodb/brew"
tap "sass/sass"
tap "talal/tap"
tap "universal-ctags/universal-ctags"
brew "aspell"
brew "automake"
brew "axel"
brew "bench"
brew "binutils"
brew "c-ares"
brew "pcre"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.8"
brew "glib"
brew "cairo"
brew "llvm"
brew "ccls"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "curl"
brew "jemalloc"
brew "libev"
brew "openldap"
brew "curl-openssl"
brew "diffutils"
brew "python"
brew "dos2unix"
brew "gmp"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "fcitx-remote-for-osx"
brew "fd"
brew "findutils"
brew "freetds"
brew "fribidi"
brew "fzf"
brew "webp"
brew "gh"
brew "git"
brew "glances"
brew "global"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "graphite2"
brew "netpbm"
brew "gts"
brew "graphviz"
brew "grep"
brew "lua"
brew "highlight"
brew "hub"
brew "ilmbase"
brew "libde265"
brew "libheif"
brew "libomp"
brew "openexr"
brew "imagemagick"
brew "imagemagick@6"
brew "jq"
brew "libpq"
brew "librsvg"
brew "libuninameslist"
brew "libuv"
brew "libvterm"
brew "libzip"
brew "lrzsz"
brew "lua@5.1"
brew "luajit"
brew "luarocks"
brew "mas"
brew "msgpack"
brew "protobuf"
brew "mysql", restart_service: true
brew "ncurses"
brew "neovim"
brew "nmap"
brew "pandoc"
brew "perl"
brew "tidy-html5"
brew "php"
brew "pkg-config"
brew "pstree"
brew "ranger"
brew "redis"
brew "ripgrep"
brew "rmtrash"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "tldr"
brew "utf8proc"
brew "tmux"
brew "tree"
brew "watchman"
brew "wget"
brew "zsh"
brew "mongodb/brew/mongodb-community"
brew "talal/tap/bonclay"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD", "with-jansson"]
cask "another-redis-desktop-manager"
cask "baidunetdisk"
cask "clashx"
cask "clipy"
cask "cyberduck"
cask "emacs"
cask "font-sarasa-gothic"
cask "font-source-han-serif"
cask "foxitreader"
cask "gitter"
cask "hammerspoon"
cask "hiddenbar"
cask "iina"
cask "iterm2"
cask "keka"
cask "mellow"
cask "microsoft-edge"
cask "mongodb-compass"
cask "motrix"
cask "mounty"
cask "mysqlworkbench"
cask "neteasemusic"
cask "postman"
cask "ppduck"
cask "pycharm-ce"
cask "qq"
cask "redis"
cask "snipaste"
cask "telegram-desktop"
cask "typora"
cask "uninstallpkg"
cask "v2rayu"
cask "visual-studio-code"
cask "webstorm"
cask "wechat"
cask "wireshark"
cask "wpsoffice"
cask "yinxiangbiji"
mas "GIPHY CAPTURE", id: 668208984
mas "Resize Master", id: 1025306797
mas "Xcode", id: 497799835
mas "网易邮箱大师", id: 1233593954
