tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask.git"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions"
tap "homebrew/core", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-core.git"
tap "homebrew/services"
tap "mongodb/brew"
tap "sass/sass"
tap "talal/tap"
brew "adns"
brew "aspell"
brew "automake"
brew "gdbm"
brew "openssl@1.1"
brew "gettext"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.9", link: true
brew "autopep8"
brew "axel"
brew "bench"
brew "binutils"
brew "black"
brew "brotli"
brew "c-ares"
brew "freetype"
brew "pcre"
brew "glib"
brew "pixman"
brew "cairo"
brew "llvm"
brew "ccls"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "libev"
brew "corectl"
brew "coreutils"
brew "curl"
brew "jansson"
brew "jemalloc"
brew "libevent"
brew "libidn"
brew "nghttp2"
brew "openldap"
brew "curl-openssl"
brew "deno"
brew "diffutils"
brew "docutils"
brew "dos2unix"
brew "fd"
brew "findutils"
brew "unixodbc"
brew "freetds"
brew "fribidi"
brew "fzf"
brew "webp"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "pcre2"
brew "git"
brew "git-lfs"
brew "global"
brew "gmp"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "pkg-config"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libgpg-error"
brew "libgcrypt"
brew "libksba"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "gotop"
brew "graphite2"
brew "grep"
brew "grip"
brew "jasper"
brew "netpbm"
brew "gts"
brew "harfbuzz"
brew "ncurses"
brew "htop"
brew "hub"
brew "ilmbase"
brew "oniguruma"
brew "jq"
brew "krb5"
brew "lf"
brew "libde265"
brew "shared-mime-info"
brew "libheif"
brew "libomp"
brew "libpq"
brew "pango"
brew "librsvg"
brew "libspiro"
brew "libuninameslist"
brew "libuv"
brew "libvterm"
brew "libyaml"
brew "libzip"
brew "little-cms2"
brew "loc"
brew "lrzsz"
brew "lua"
brew "luajit"
brew "luarocks"
brew "mas"
brew "msgpack"
brew "protobuf"
brew "mysql", restart_service: true
brew "nmap"
brew "openexr"
brew "pandoc"
brew "perl"
brew "poetry"
brew "pstree"
brew "pylint"
brew "redis"
brew "ripgrep"
brew "rmtrash"
brew "ruby"
brew "screenfetch"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "swig"
brew "tldr"
brew "utf8proc"
brew "tmux"
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "yapf"
brew "zsh"
brew "mongodb/brew/mongodb-community"
brew "talal/tap/bonclay"
cask "another-redis-desktop-manager"
cask "baidunetdisk"
cask "calibre"
cask "cheatsheet"
cask "clipy"
cask "cyberduck"
cask "electron"
cask "fliqlo"
cask "font-sarasa-gothic"
cask "font-source-han-serif"
cask "foxitreader"
cask "gitter"
cask "hiddenbar"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
cask "kindle"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "mongodb-compass"
cask "mos"
cask "motrix"
cask "mysqlworkbench"
cask "neteasemusic"
cask "ntfstool"
cask "oracle-jdk"
cask "osxfuse"
cask "picgo"
cask "postman"
cask "ppduck"
cask "pycharm-ce"
cask "qq"
cask "rectangle"
cask "redis"
cask "sequel-pro"
cask "snipaste"
cask "typora"
cask "v2rayu"
cask "visual-studio-code"
cask "webstorm"
cask "wechat"
cask "wireshark"
cask "wpsoffice"
cask "yinxiangbiji"
mas "GIPHY CAPTURE", id: 668208984
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Resize Master", id: 1025306797
mas "Xcode", id: 497799835
mas "网易邮箱大师", id: 1233593954
